Revit 2026 API

# WaterType Enumeration

---

The enumerated type representing the permitted values for the asset property "WaterType" from the "Water" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum WaterType
```
```vb
Public Enumeration WaterType
```
```cpp
public enum class WaterType
```
```fsharp
type WaterType
```

| Member name | Value | Description |
| --- | --- | --- |
| Lake | 3 |  |
| Ocean | 4 |  |
| ReflectingPool | 1 |  |
| River | 2 |  |
| SwimmingPool | 0 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace